struct GlobalVars {
	char fuzzingCoefficientPadding0[0xc]; // 0x0
	char fuzzingCoefficientPadding1[0xc]; // 0xC
	char fuzzingCoefficientPadding2[0xc]; // 0x18
	char fuzzingCoefficientPadding3[0xc]; // 0x24
	char fuzzingCoefficientPadding4[0xc]; // 0x30
	char fuzzingCoefficientPadding5[0xc]; // 0x3C
	char fuzzingCoefficientPadding6[0xc]; // 0x48
	char fuzzingCoefficientPadding7[0xc]; // 0x54
	char fuzzingCoefficientPadding8[0xc]; // 0x60
	char fuzzingCoefficientPadding9[0xc]; // 0x6C
	char fuzzingCoefficientPadding10[0xc]; // 0x78
	char fuzzingCoefficientPadding11[0xc]; // 0x84
	char fuzzingCoefficientPadding12[0xc]; // 0x90
	char fuzzingCoefficientPadding13[0xc]; // 0x9C
	char fuzzingCoefficientPadding14[0xc]; // 0xA8
	char fuzzingCoefficientPadding15[0xc]; // 0xB4
	char hasRecievedLowMemoryWarning; // 0xC0
	char VERBOSE_ASSET_LOADING; // 0xC1
	int MaxBundleDownloadThreadsHD; // 0xC4
	int MaxBundleDownloadThreadsSD; // 0xC8
	char SPLUNK_RETRY_LOGS; // 0xCC
	char ENABLE_GAME_REVIEW_RATING_PROMPT; // 0xCD
	char ENABLE_GAME_REVIEW_RATING_RE_PROMPT; // 0xCE
	float OUT_OF_DISK_SPACE_THRESHOLD_MB; // 0xD0
	double MINS_BETWEEN_MEM_WARNINGS; // 0xD8
	float RANGE_SCAN_COEFFICIENT; // 0xE0
	double DOUBLE_PRECISION_CHECK; // 0xE8
	float DEFAULT_SERVER_CONNECT_TIMEOUT_TIME; // 0xF0
	int MAX_BATTERING_RAM_WALL_SEARCH_ATTEMPTS; // 0xF4
	int MAX_BATTERING_RAM_WALL_SEARCH_ATTEMPTS_PER_FRAME; // 0xF8
	float LARGE_REQUEST_TIMEOUT_TIME; // 0xFC
	float STANDARD_REQUEST_TIMEOUT_TIME; // 0x100
	float MINOR_REQUEST_TIMEOUT_TIME; // 0x104
	float ON_HARVEST_SAVE_COOLDOWN; // 0x108
	int MINOR_REQUEST_RETRIES; // 0x10C
	float REQUEST_RETRY_TIME; // 0x110
	char isDoingCombatTest; // 0x114
	char artVideoMode; // 0x115
	char isInStreamingReplayMode; // 0x116
	char LeagueDebug; // 0x117
	Vector3 LeagueBoatTargetLoc; // 0x118
	Vector3 LeagueBoatStartingLoc; // 0x124
	Vector3 LeagueBoatEndingLoc; // 0x130
	Vector3 ExpeditionBoatEndingLoc; // 0x13C
	Vector3 LeagueDockLoc; // 0x148
	float LeagueBoatZLayer; // 0x154
	int LeagueNumRewards; // 0x158
	float frameTimeLost; // 0x15C
	void *PARTICLES_FILE_PATH; // 0x160
	int isAutomatedBuild; // 0x168
	void *FontReplacements; // 0x170
	Vector3 TurtleShipLoc; // 0x178
	char shouldAlwaysShowDebugInterrupt; // 0x184
	char hasShownNetworkErrorPopup; // 0x185
	char inputEnabled; // 0x186
	/*Stopwatch*/ void *gameInitStopwatch; // 0x188
	int DisableIsobodyVerification; // 0x190
	float AUDIO_STACKING_THRESHOLD_MS; // 0x194
	int FLUSH_TIME_SEC; // 0x198
	int QUEUE_DEPTH_WARNING_THRESHOLD; // 0x19C
	int MAX_TIMEBEHIND_SEC; // 0x1A0
	int FLUSH_ON_EACH_FIXED_UPDATE; // 0x1A4
	int ANALYTICS_FLUSH_TIME_SEC; // 0x1A8
	int fastReplays; // 0x1AC
	float TIME_BEHIND_FOR_NOTICE; // 0x1B0
	float TIME_BEHIND_FOR_ERROR; // 0x1B4
	float TIME_BEHIND_FOR_BATTLE_ERROR; // 0x1B8
	float AVG_LATENCY_COEFFICIENT; // 0x1BC
	int CAMERA_SOFT_CLOSE_ZOOM; // 0x1C0
	int CAMERA_HARD_CLOSE_ZOOM; // 0x1C4
	int CAMERA_SOFT_FAR_ZOOM; // 0x1C8
	int CAMERA_HARD_FAR_ZOOM; // 0x1CC
	int allianceCrestID; // 0x1D0
	int peaceTreatyCancelBonusMax; // 0x1D4
	char ENABLE_TARGET_SELECTOR_NULL_CHECK_FAIL; // 0x1D8
	char ENABLE_VALIDATE_REPLAYS; // 0x1D9
	char ReplayRecordRands; // 0x1DA
	int ReplayDataVersion; // 0x1DC
	double ReplayShareCooldownMinutes; // 0x1E0
	double ChallengeRequestCooldownMinutes; // 0x1E8
	double MapEditChallengeCooldownMinutes; // 0x1F0
	double ChallengeDurationMinutes; // 0x1F8
	int FriendlyBattlesEnabled; // 0x200
	double IDLE_TIMEOUT; // 0x208
	float IDLE_CHECK_HEARTBEAT_SECONDS; // 0x210
	float TROOP_TARGET_RANGE_SEARCH_COEFFICIENT; // 0x214
	char isLoadingPlayer; // 0x218
	char _inPersistenceError; // 0x219
	char combatDebug; // 0x21A
	char EnableUnusedWindowPopups; // 0x21B
	char MasterAnalyticsEnable; // 0x21C
	char MasterSplunkEnable; // 0x21D
	char WriteToSplunk; // 0x21E
	char ForceSplunkUnhandledExceptions; // 0x21F
	char LoadGooglePlayerStats; // 0x220
	int BundleDownloadDataPreviewSize; // 0x224
	int BundleProgressReportSampling; // 0x228
	char DisableGCForAllLoadScreens; // 0x22C
	char DisableGCForFtueBattleLoadScreen; // 0x22D
	char createdAlliance; // 0x22E
	int PLAYER_STARTING_TROPHIES; // 0x230
	char isWaitingForAttackToComplete; // 0x234
	char isInSoftReset; // 0x235
	char isInAssetBundleFailure; // 0x236
	char ForceNextConfigDownload; // 0x237
	int BASE_MOVE_COST; // 0x238
	void *WEST_OPENURL; // 0x240
	void *ASIA_OPENURL; // 0x248
	void *DEV_ANALYTICS_URL; // 0x250
	void *QA_ANALYTICS_URL; // 0x258
	void *LIVE_ANALYTICS_URL; // 0x260
	void *SPLUNK_URL; // 0x268
	char isWakingUp; // 0x270
	char isResetting; // 0x271
	char inMapEditorMode; // 0x272
	char inStartPlayerAttack; // 0x273
	char inFindingNextMatch; // 0x274
	char noOpponentFound; // 0x275
	char isInBattleCompletion; // 0x276
	char isInBattle; // 0x277
	char returningFromBattle; // 0x278
	char isWorldFinishedPopulating; // 0x279
	char isInWorldInitialization; // 0x27A
	char isFightFastEnabled; // 0x27B
	char isInReplayTestMode; // 0x27C
	char isInReplayInitialization; // 0x27D
	char isInReplayPausedState; // 0x27E
	char isInRequiresAppUpdate; // 0x27F
	char isUnderAttack; // 0x280
	char isPossiblyIdle; // 0x281
	char isPossiblyAFK; // 0x282
	void *lastElapsedTimeString; // 0x288
	int initCounter; // 0x290
	char inUnitTestMode; // 0x294
	char isPurchasingBuilding; // 0x295
	char isLoadingFromFile; // 0x296
	char timedQuestsOnly; // 0x297
	void *HelpShift_API_KEY; // 0x298
	void *HelpShift_DOMAIN_NAME; // 0x2A0
	void *HelpShift_APP_ID_IOS; // 0x2A8
	void *HelpShift_APP_ID_ANDROID; // 0x2B0
	void *HelpShift_Notification_Help_IOS; // 0x2B8
	void *HelpShift_Notification_Help_ANDROID; // 0x2C0
	char NotificationFilteringEnabled; // 0x2C8
	int NotificationPromptFirstRescheduleDays; // 0x2CC
	void *CSEmail; // 0x2D0
	void *FeedbackEmail; // 0x2D8
	void *Gamename; // 0x2E0
	int FAQCount; // 0x2E8
	int FAQDeviceCount; // 0x2EC
	int DeviceLinkCodeLife; // 0x2F0
	char ShowAutoOpenMysteryBoxTime; // 0x2F4
	char EnableMultiShipmentFromInventory; // 0x2F5
	char timeWarpMode; // 0x2F6
	int InitSpeed; // 0x2F8
	long firstConnectedLoginTime; // 0x300
	long AFK_TIME_MILLIS; // 0x308
	float IDLE_INACTION_SECONDS; // 0x310
	double CAPTCHA_TIMEOUT_SECONDS; // 0x318
	int CAPTCHA_TEXT_LENGTH; // 0x320
	int NUM_AGES; // 0x324
	int NUM_ROAD_LEVELS; // 0x328
	float TROOP_OVERKILL_COEFFICIENT; // 0x32C
	double lastInputTime; // 0x330
	/*FuzzedInt*/ void *MAXIMUM_ALLOWED_AGE; // 0x338
	double DOUBLE_TAP_TIME; // 0x340
	double OFFLINE_TIMEOUT; // 0x348
	char ApplicationDebugWarningRect[0x10]; // 0x350
	int ApplicationMinSystemMemory; // 0x360
	int ApplicationMinGPUMemory; // 0x364
	short LIB_GC_DIVISOR_DEFAULT; // 0x368
	short LIB_GC_DIVISOR_SAVE_MEMORY; // 0x36A
	int WorldWidth; // 0x36C
	int WorldHeight; // 0x370
	int PauseTimeForReset; // 0x374
	int AnimMgrCacheSprites; // 0x378
	int AnimMgrMaxCachedFrames; // 0x37C
	char GoodGuyColor[0x10]; // 0x380
	char NeutralColor[0x10]; // 0x390
	char BadGuyColor[0x10]; // 0x3A0
	char EmpowerColor[0x10]; // 0x3B0
	char QuickMarchColor[0x10]; // 0x3C0
	char InvulnerableColor[0x10]; // 0x3D0
	char TrampleColor[0x10]; // 0x3E0
	char WorldWarGoodGuyColor[0x10]; // 0x3F0
	char WorldWarPlayerColor[0x10]; // 0x400
	char WorldWarNeutralColor[0x10]; // 0x410
	char WorldWarBadGuyColor[0x10]; // 0x420
	int RENDERQUEUE_BACKGROUND; // 0x430
	int RENDERQUEUE_GEOMETRY; // 0x434
	int RENDERQUEUE_ALPHATEST; // 0x438
	int RENDERQUEUE_TRANSPARENT; // 0x43C
	int RENDERQUEUE_OVERLAY; // 0x440
	int RENDERQUEUE_LOW_FILL_GRASS_BACKGROUND; // 0x444
	float DEBUG_INTERRUPT_WINDOW_TIME; // 0x448
	char FIGHT_SPEEDUP_ENABLED; // 0x44C
	float MAX_SPEEDUP_SCALE; // 0x450
	int CAMERA_ZOOM_ADVANCE_SPEED; // 0x454
	int CAMERA_ZOOM_RETREAT_SPEED; // 0x458
	float IMMUTABLE_CAMERA_DAMPENING_FACTOR; // 0x45C
	float MUTABLE_CAMERA_DAMPENING_FACTOR; // 0x460
	void *MAP_EDIT_KEY; // 0x468
	float CAMERA_MAX_PAN_X; // 0x470
	float CAMERA_MAX_PAN_Y; // 0x474
	float BASE_CAMERA_MAX_PAN_X; // 0x478
	float BASE_CAMERA_MAX_PAN_Y; // 0x47C
	float CTW_CAMERA_MAX_PAN_X; // 0x480
	float CTW_CAMERA_MAX_PAN_Y; // 0x484
	float WW_CAMERA_MAX_ZOOM_IN; // 0x488
	float WW_CAMERA_MAX_ZOOM_OUT; // 0x48C
	float WW_CAMERA_MAX_PAN_X; // 0x490
	float WW_CAMERA_MAX_PAN_Y; // 0x494
	float WW_CAMERA_LOD_START; // 0x498
	float WW_CAMERA_LOD_FINISH; // 0x49C
	char worldWarMode; // 0x4A0
	char worldWarPlansEnabled; // 0x4A1
	char worldWarLoadingUI; // 0x4A2
	char WorldWarAXPEnabled; // 0x4A3
	float PLACEMENT_FIND_PATH_DELAY; // 0x4A4
	float ARROW_MOVE_SPEED; // 0x4A8
	float ATTACK_RANGE_PADDING; // 0x4AC
	int AttackHistoryLifetimeDays; // 0x4B0
	char outputServerErrorsToSplunk; // 0x4B4
	char overrideServerErrorsToSplunk; // 0x4B5
	char STOREHOUSE_ENABLED; // 0x4B6
	float trade_good_loot_protection; // 0x4B8
	float RESOURCE_GENERATOR_LOOT_PROTECTION; // 0x4BC
	float RESOURCE_CONTAINER_LOOT_PROTECTION; // 0x4C0
	int MAX_VICTORY_STARS; // 0x4C4
	int MAX_STAR_INDEX; // 0x4C8
	int LOSE_STAR_INDEX; // 0x4CC
	float CHAT_HEARTBEAT; // 0x4D0
	int CHAT_MESSAGE_RETRY; // 0x4D4
	char CHAT_CONNECTED; // 0x4D8
	char BASE_64_ENCODE_CHAT; // 0x4D9
	double FREE_TIME; // 0x4E0
	double FREE_CANCEL_BUFFER; // 0x4E8
	int REWARD_VARIANCE; // 0x4F0
	float FTUE_TOWER_AND_BARRACKS_BUILD_TIME; // 0x4F4
	float FTUE_FIRST_BUILD_TIME; // 0x4F8
	Vector3 TROOP_CAMP_OFFSET; // 0x4FC
	float TROOP_CAMP_COLUMN_CUSHION; // 0x508
	float TROOP_CAMP_ROW_CUSHION; // 0x50C
	int TROOP_CAMP_MAX_COLUMNS_PER_ROW; // 0x510
	Vector3 AIR_BARRACKS_OFFSET; // 0x514
	float AIR_BARRACKS_COLUMN_CUSHION; // 0x520
	float AIR_BARRACKS_ROW_CUSHION; // 0x524
	int AIR_BARRACKS_MAX_COLUMNS_PER_ROW; // 0x528
	Vector3 OIL_BARRACKS_OFFSET; // 0x52C
	float OIL_BARRACKS_COLUMN_CUSHION; // 0x538
	float OIL_BARRACKS_ROW_CUSHION; // 0x53C
	int OIL_BARRACKS_MAX_COLUMNS_PER_ROW; // 0x540
	double generalCooldownOffense; // 0x548
	double generalCooldownDefense; // 0x550
	double generalRetrainTimeDiscountFlatAmount; // 0x558
	float thirdGeneralCostMultiplier; // 0x560
	int AllianceMemberCap; // 0x564
	int SuggestedAllianceMemberCutoff; // 0x568
	double AllianceSpeedUpPercentage; // 0x570
	int fullfillmentCap; // 0x578
	double troopRequestCooldown; // 0x580
	double speedupRequestCooldown; // 0x588
	int AllianceBookmarkCap; // 0x590
	char EmbassyEnable; // 0x594
	Vector3 EmbassyLocation; // 0x598
	Vector3 MuseumLocation; // 0x5A4
	Vector3 MuseumGuitarPickPosition; // 0x5B0
	char CoalitionDynamicPricingEnabled; // 0x5BC
	char embassyRequiresCommandPost; // 0x5BD
	double CoalitionPriceRequestTimeout; // 0x5C0
	int MAX_TROOP_DONATIONS; // 0x5C8
	/*FuzzedInt*/ void *troopQueueOverflowAmount; // 0x5D0
	/*FuzzedInt*/ void *m_fuzzedCreateAllianceCost; // 0x5D8
	int STARTING_GEMS; // 0x5E0
	int SHIPMENT_RANDOMNESS; // 0x5E4
	int MaxRatingReq; // 0x5E8
	int MaxGloryReq; // 0x5EC
	int MinGlory; // 0x5F0
	int AllianceAgeReq; // 0x5F4
	float UpdateTroopRequestHeartbeat; // 0x5F8
	float UpdateSpeedUpRequestHeartbeat; // 0x5FC
	int MAX_PATHING_REQUESTS_PER_FRAME; // 0x600
	char padding0[0x4]; // 0x604
	double EasyTimedQuestCooldown; // 0x608
	double MediumTimedQuestCooldown; // 0x610
	double HardTimedQuestCooldown; // 0x618
	/*FuzzedInt*/ void *maxClaimableInventoryTroops; // 0x620
	int MaxArtifactInventoryCap; // 0x628
	int MaxArtifactLevel; // 0x62C
	char UseArtifactShaders; // 0x630
	char DailyArtifactEnabled; // 0x631
	char DailyCurrencyEnabled; // 0x632
	int BattleFragmentChanceNumerator; // 0x634
	int BattleFragmentChanceDenominator; // 0x638
	monoArray<int *> *m_victoryStarFragmentAmount; // 0x640
	int EnableMuseumWarWing; // 0x648
	float BlueprintConversionRate; // 0x64C
	float MAX_COST_DISCOUNT; // 0x650
	float MAX_DEBUFF_AMOUNT; // 0x654
	monoArray</*FuzzedInt*/ void **> *m_nextMatchConfigs; // 0x658
	monoArray</*FuzzedInt*/ void **> *m_victoryFoodBonusConfigs; // 0x660
	monoArray</*FuzzedInt*/ void **> *m_victoryGoldBonusConfigs; // 0x668
	monoArray</*FuzzedInt*/ void **> *m_victoryOilBonusConfigs; // 0x670
	int nextMatchCostKey; // 0x678
	int MAX_SEARCH_TIME; // 0x67C
	double BATTLE_DURATION; // 0x680
	float POST_BATTLE_DURATION; // 0x688
	float TIME_UNTIL_TROOPS_SALUTE; // 0x68C
	double QUICK_VICTORY_TIME; // 0x690
	int blessingDamageThreshold; // 0x698
	int matchmakingLowerStep; // 0x69C
	int matchmakingUpperStep; // 0x6A0
	char matchmakingUnavailable; // 0x6A4
	char purchasingUnavailable; // 0x6A5
	void *m_defenseRewards; // 0x6A8
	monoArray<float *> *m_townhallDeltaCoefficient; // 0x6B0
	monoArray<float *> *m_townhallProtectionByLevel; // 0x6B8
	monoArray<float *> *m_townhallProtectionByLevelWarLootContainer; // 0x6C0
	monoArray</*FuzzedInt*/ void **> *m_resourceCapThatCanBeStolen; // 0x6C8
	/*FuzzedInt*/ void *m_frenchExtraDonationCap; // 0x6D0
	monoArray<float *> *m_oilTownHallDeltaCoefficient; // 0x6D8
	monoArray<float *> *m_oilTownHallProtectionByLevel; // 0x6E0
	monoArray</*FuzzedInt*/ void **> *m_oilCapThatCanBeStolen; // 0x6E8
	int wwRewardWinFactorRubiesMultiplier; // 0x6F0
	int wwRewardWinFactorRubiesDivisor; // 0x6F4
	int wwRewardLossFactorRubiesMultiplier; // 0x6F8
	int wwRewardLossFactorRubiesDivisor; // 0x6FC
	int wwRewardTieFactorRubiesMultiplier; // 0x700
	int wwRewardTieFactorRubiesDivisor; // 0x704
	int rubiesMinAgeDelta; // 0x708
	int rubiesMaxAgeDelta; // 0x70C
	monoArray<int *> *m_ageDeltaOverpowerPenaltyRubiesMultiplier; // 0x710
	monoArray<int *> *m_ageDeltaOverpowerPenaltyRubiesDivisor; // 0x718
	float OIL_GENERATOR_LOOT_PROTECTION; // 0x720
	float OIL_CONTAINER_LOOT_PROTECTION; // 0x724
	float LOADING_WIN_TIMEOUT_TIME_SECONDS; // 0x728
	char ALLOW_SOFT_RESET_ON_LOADING_WIN_TIMEOUT; // 0x72C
	char CRASH_ON_ACCOUNT_SWAP_DETECTED; // 0x72D
	float FixedPoint; // 0x730
	int CTW_EVENT_ACTIVE; // 0x734
	int CTW_EVENT_ID; // 0x738
	int CTW_EVENTS_ENABLED; // 0x73C
	float CTW_EVENT_WINDOW_POSITION_Y; // 0x740
	float CTW_EVENT_WINDOW_POSITION_X; // 0x744
	int COALITION_SUMMON_ARMY_SPELL; // 0x748
	/*FuzzedInt*/ void *defensive_weight_priority_whole_number; // 0x750
	/*FuzzedInt*/ void *defensive_weight_priority_fraction; // 0x758
	/*FuzzedInt*/ void *defensive_weight_target_behind_wall_whole_number; // 0x760
	/*FuzzedInt*/ void *defensive_weight_target_behind_wall_fraction; // 0x768
	/*FuzzedInt*/ void *defender_tech_tank_threshold; // 0x770
	/*FuzzedInt*/ void *defender_tech_tank_reduction; // 0x778
	/*FuzzedInt*/ void *defender_blessing_tank_threshold; // 0x780
	/*FuzzedInt*/ void *defender_blessing_tank_reduction; // 0x788
	float minDefenderFactoryInitialDelay; // 0x790
	char EnableSendingBattleResultsScreen; // 0x794
	int maxVictoryStarBonus; // 0x798
	double victoryStarBonusResetTime; // 0x7A0
	double sendingResultsTimeout; // 0x7A8
	float TROOP_SPREAD; // 0x7B0
	float knockback_distance; // 0x7B4
	float FTUETrainTime; // 0x7B8
	int FTUEUpgradeArmyThreshold; // 0x7BC
	int FTUEUpgradeArmyAgeThreshold; // 0x7C0
	int m_generalCooldownCostDivisor; // 0x7C4
	char GeneralsRequireTraining; // 0x7C8
	char EnableRetrainWin; // 0x7C9
	char ResourcePersistenceError; // 0x7CA
	char TroopPersistenceError; // 0x7CB
	char TrayPersistenceError; // 0x7CC
	char OnTroopDeployedPersistenceError; // 0x7CD
	char BattleTimePersistenceError; // 0x7CE
	char TechDamagePersistenceError; // 0x7CF
	/*FuzzedInt*/ void *fuzzedTechDamagePersistenceErrorThreshold; // 0x7D0
	char TechBlessingAmountPersistenceError; // 0x7D8
	/*FuzzedInt*/ void *fuzzedTechBlessingAmountPersistenceErrorThreshold; // 0x7E0
	char BlessingAmountPersistenceError; // 0x7E8
	/*FuzzedInt*/ void *fuzzedBlessingAmountPersistenceErrorThreshold; // 0x7F0
	char ValidatePersistentXP; // 0x7F8
	char CommandPostFtueEnabled; // 0x7F9
	char ValidatePlayerModel; // 0x7FA
	char EnableTownHallAgeMismatchLogging; // 0x7FB
	char SoftResetImmediately; // 0x7FC
	int Network_MinPOSTDataCompressionSize; // 0x800
	int Network_MaxPOSTDataCompressionSize; // 0x804
	int ServerTimeoutTimeSeconds; // 0x808
	int ServerReturnValidationTimeoutMinutes; // 0x80C
	int CDNRetryWaitTimeIncrementInMS; // 0x810
	void *binaryPadding; // 0x814
	int ReminderTime; // 0x81C
	int TrapRearmCostKey; // 0x820
	int MercArmyBlockSize; // 0x824
	int RoadNetworkBonus; // 0x828
	void *m_roadNetworkHealthBonus; // 0x830
	char validate_building_counts; // 0x838
	char repair_building_counts; // 0x839
	char validate_player_model_counts; // 0x83A
	char recover_broken_ftue; // 0x83B
	char validate_town_hall; // 0x83C
	void *validate_building_report_list; // 0x840
	void *validate_building_correct_list; // 0x848
	void *expected_building_counts; // 0x850
	char library_second_slot_enabled; // 0x858
	char battlePrepScreenForNormalBattleEnabled; // 0x859
	float FTUEHuntTime; // 0x85C
	monoArray<int *> *m_huntingDamageAgeConfigs; // 0x860
	float harvest_icon_storage_threshold; // 0x868
	double harvest_icon_time_threshold; // 0x870
	int harvest_icon_min_cap_threshold; // 0x878
	double WONDER_BONUS_PROCESS_TIME; // 0x880
	int WONDER_REPLACE_COST_TYPE; // 0x888
	void *m_wonder_replace_costs; // 0x890
	void *m_wonder_replace_citizens; // 0x898
	void *m_wonder_replace_time; // 0x8A0
	int NATION_CHANGE_COST_TYPE; // 0x8A8
	int NATION_CHANGE_AGE; // 0x8AC
	monoList<void **/*FuzzedInt*/> *m_nation_change_costs; // 0x8B0
	int NATION_CHANGE_CITIZENS_USED; // 0x8B8
	double OldestHelpRequestCheck; // 0x8C0
	double OldestChatMessageCheck; // 0x8C8
	char EnableReplayPause; // 0x8D0
	char TrainNavSlide; // 0x8D1
	char useWorldWarLayout; // 0x8D2
	int numLayouts; // 0x8D4
	int numWorldWarLayouts; // 0x8D8
	int currentLayout; // 0x8DC
	int currentWorldWarLayout; // 0x8E0
	char worldWarEnabled; // 0x8E4
	char worldWarReplaysEnabled; // 0x8E5
	char worldWarReplayBeta; // 0x8E6
	char ForceWorldWarReplay; // 0x8E7
	char EnableReplayDebug; // 0x8E8
	char ReplayDebugWriteLocal; // 0x8E9
	char ReplayDebugWriteOnSuccess; // 0x8EA
	char shareReplaysEnabled; // 0x8EB
	char shareWorldWarReplaysEnabled; // 0x8EC
	void *m_alliance_xp_war_base_defeated; // 0x8F0
	int alliance_xp_war_40pct_stars_bonus; // 0x8F8
	int alliance_xp_war_60pct_stars_bonus; // 0x8FC
	int alliance_xp_war_win_bonus; // 0x900
	char ResourcePurchaseActive; // 0x904
	char EnablePurchasedResourceDisplay; // 0x905
	void *player_info_army; // 0x908
	monoList<int *> *player_info_economy; // 0x910
	void *player_info_defense; // 0x918
	void *DonatableTroops; // 0x920
	void *DonatableTroopsWW; // 0x928
	float CAMERA_DEFAULT_ZOOM; // 0x930
	int AUDIO_MAX_CONCURRENT_CLIPS; // 0x934
	int AUDIO_MAX_CONCURRENT_CLIPS_SD; // 0x938
	int ATTACK_LIMITER_MAX_ATTACKERS_MELEE; // 0x93C
	int ATTACK_LIMITER_MAX_ATTACKERS_RANGE; // 0x940
	monoArray<float *> *m_lootProtectionByAgeDelta; // 0x948
	void *m_ageLevelReqs; // 0x950
	void *m_houseHealth; // 0x958
	void *m_estateHealth; // 0x960
	int LEAGUES_ENABLED; // 0x968
	double LeagueBoatSpawnTime; // 0x970
	char videoAdsEnabled; // 0x978
	char offerWallEnabled; // 0x979
	int fyberNumRetries; // 0x97C
	int videoAdStartAge; // 0x980
	int offerWallStartAge; // 0x984
	int maxVideoAds; // 0x988
	double videosWatchedResetTime; // 0x990
	int videoRewardSyncDelaySeconds; // 0x998
	char showSlowVideoRewardPopup; // 0x99C
	char EnableAllianceGifting; // 0x99D
	char EnableAllianceCurrency; // 0x99E
	int RUBIES_HARD_CAP; // 0x9A0
	int HouseBuyWinTriggerCount; // 0x9A4
	char HouseBuyWinEnabled; // 0x9A8
	void *HouseBuyWinSpecialDeals; // 0x9B0
	char EnableTk2dUI; // 0x9B8
	char DoMapExpansion; // 0x9B9
	float jannisaryBoostMultiplier; // 0x9BC
	float TouchPadding; // 0x9C0
	float TouchCornerRadius; // 0x9C4
	char ForceOldTouchCollision; // 0x9C8
	char ForceDisableIdle; // 0x9C9
	char UnlockLanguages; // 0x9CA
	char UnlockAsianLanguages; // 0x9CB
	int emissaryCounter; // 0x9CC
	int EnableExpeditions; // 0x9D0
	double expeditionRefreshTime; // 0x9D8
	int maxExpeditionSlots; // 0x9E0
	char BlessingEventActive; // 0x9E4
	char SupplyDropActive; // 0x9E5
	void *SupplyDropHash; // 0x9E8
	char EventSystemEnabled; // 0x9F0
	void *EventSystemHash; // 0x9F8
	void *EventDetailHash; // 0xA00
	int EventTierUpdate; // 0xA08
	double EVENT_BONUS_PROCESS_TIME; // 0xA10
	double EVENT_GENERAL_COLLECT_PROCESS_TIME; // 0xA18
	double EVENT_PRESENTS_COLLECT_PROCESS_TIME; // 0xA20
	int EVENT_OIL_COLLECT_MULTIPLIER; // 0xA28
	int EVENT_KILL_DEFENDER_MACHINE_GUN_MULTIPLIER; // 0xA2C
	int EVENT_DEAL_DAMAGE_RANGED_SIEGE_MULTIPLIER; // 0xA30
	int OneEventBuildingAtATime; // 0xA34
	void *PromoHashes; // 0xA38
	void *SaleHashes; // 0xA40
	char EnableSaleSystem; // 0xA48
	char saleActive; // 0xA49
	char crownSaleActive; // 0xA4A
	/*FuzzedInt*/ void *m_fuzzedSaleSameTacticCap; // 0xA50
	int AgeUpDealEnabled; // 0xA58
	void *AgeUpDealHash; // 0xA60
	char EnableAgeUpDealCurrencySymbol; // 0xA68
	char EnableAgeUpDealStrikeThru; // 0xA69
	double ConfigShowMePulseDuration; // 0xA70
	void *crownSalePacakageLookup; // 0xA78
	void *TravelingMerchantHash; // 0xA80
	Vector3 TravelingMerchantLocation; // 0xA88
	float TravelingMerchantInitZoom; // 0xA94
	int TravelingMerchantLoginNumAppear; // 0xA98
	double TravelingMerchantLoginReset; // 0xAA0
	void *TravelingMerchantSplash; // 0xAA8
	char TravelingMerchantIsActive; // 0xAB0
	char TravelingMerchantPanOn; // 0xAB1
	float MysteryBoxRarityThreshold; // 0xAB4
	char AdvisorEnabled; // 0xAB8
	char isToggleDeleteOn; // 0xAB9
	char FacebookEnabled; // 0xABA
	int CurrencyOverflowLimit; // 0xABC
};